# 확인문제 1. 자료형을 나타내는 단어 쓰기
## 273, 52, 0, 1234, -25 : 소수점이 없는 정수형
print(type(273))
print(type(0))
print(type(1234))
print(type(-25))

## 0.0, 1.234, 2.73e2, -25.0 : 소수점이 있는 실수형(부동 소수형)
print(type(0.0))
print(type(1.234))
print(type(2.73e2))
print(type(-25.0))

# 확인문제 2. 연산자 기호 쓰기
## 덧셈 연산자 : +
## 뺄셈 연산자 : -
## 곱셈 연산자 : *
## 나눗셈 연산자 : /
## 정수 나누기 연산자 : //
## 나머지 연산자 : %
## 제곱 연산자 : **

# 확인문제 3. 실행결과 예측하기
print("# 기본적인 연산") # # 기본적인 연산
print(15, "+", 4, "=", 15 + 4) # 15 + 4 = 19
print(15, "-", 4, "=", 15 - 4) # 15 - 4 = 11
print(15, "*", 4, "=", 15 * 4) # 15 * 4 = 60
print(15, "/", 4, "=", 15 / 4) # 15 / 4 = 3.75

# 확인문제 4. 3462를 17로 나누었을 때 몫과 나머지를 구하는 프로그램
print("3462를 17로 나누었을 때의")
print("- 몫: ", 3462 // 17)
print("- 나머지: ", 3462 % 17)

# 확인문제 5. 다음 코드의 실행결과 예측하기
print(2 + 2 - 2 * 2 / 2 * 2) # 3
print(2 - 2 + 2 / 2 * 2 + 2) # 4

