# 확인문제 1.
print("글자")
print('글자')
print("""문자열
문자열
문자열""")

# 확인문제 2.
print("\"큰 따옴표\"를 의미합니다")
print('\'작은 따옴표 \'를 의미합니다')
print("줄바꿈\n을 의미합니다")
print("탭\t을 의미합니다")
print("\\을 의미합니다")

# 확인문제 3. 실행결과 예측하기
print("# 연습문제") # #연습문제
print("\\\\\\\\") # \\\\\\
print("-" * 8) # --------

# 확인문제 4. 실행결과 예측하기
print("안녕하세요"[1]) #녕
print("안녕하세요"[2]) #하
print("안녕하세요"[3]) #세
print("안녕하세요"[4]) #요
#print("안녕하세요"[5]) #error

# 확인문제 5. 실행결과 예측하기
print("안녕하세요"[1:3]) # 녕하
print("안녕하세요"[2:4]) # 하세
print("안녕하세요"[1:])  # 녕하세요
print("안녕하세요"[:3])  # 안녕하


